{
 "version": "https://jsonfeed.org/version/1",
 "title": "Mike Saburenkov",
 "home_page_url": "https://mikesub.net/blog/",
 "feed_url": "https://mikesub.net/blog/feed.json",
 "items": [
  {
   "title": "HTML MCP",
   "id": "https://mikesub.net/blog/html-mcp.html",
   "url": "https://mikesub.net/blog/html-mcp.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/wires.jpg\" alt=\"\"></p>\n<p>I’ve been playing around with MCP lately, trying to figure out what it’s really about. I remember when OpenAI introduced function calling two years ago — that felt like a big deal. It was that missing piece: LLMs struggle with simple deterministic stuff — like counting how many rs are in strawberry, and doing basic math. But they’re smart enough to ask for help, if you tell them how to ask.</p>\n<p>Basically, you could now prompt LLMs with:</p>\n<pre><code>What is 8 * 23?\nAnd by the way, if you need a calculator, \njust reply with “CALC: formula” and I’ll give you the result, \nso you can use this information in your final answer.</code></pre><p>And suddenly LLMs were getting the weather, sending emails and searching knowledge bases.</p>\n<p>Then, two years later, came MCP. It’s still tool calling, but with some added plumbing: a way to discover tools, communicate results, handle invocation, etc. The protocol design decisions are quite questionable so far, and the docs/SDKs are clearly early-stage — but the direction makes sense. Eventually, it’ll be usable and maybe even nice.</p>\n<p>Besides “Why not use WebSockets?”, one of the most common questions I see about MCP is “Why not just use OpenAPI?” And the arguments tend to be:</p>\n<ol>\n<li>Token efficiency — specs are large, and LLMs get overwhelmed or hallucinate more with too much irrelevant context. JSON should be dense and purpose-built.</li>\n<li>OpenAPI specs are static. MCP supports more dynamic tool usage (whatever that exactly means).</li>\n</ol>\n<p>Neither argument feels super convincing as a reason to design a new protocol... but that’s not the point of this post. I want to go even further back — before OpenAPI — to REST itself.</p>\n<p>A decade ago, I was designing a public HTTP API for a SaaS product. Back then, even choosing JSON over XML felt edgy. We spent days arguing about what makes an API “RESTful”: what HTTP methods to use, what status codes to return, how to structure paths, all that. And we talked about HATEOAS.</p>\n<p>It felt utopian — the idea that you could fully navigate and use APIs just from what the server gives you in responses. For machine-consumable JSON APIs, it didn’t really work. No clear way to describe input schemas, required fields, or methods. And even if we had it all, you can&#39;t just script the algorithm to use it, you need human agency to interpret the responses. It worked fine for things like pagination: <code>&quot;next_page_url&quot;</code>, where clients could write their logic to follow the link, but for more complex workflows, we quickly dropped it.</p>\n<p>Fast forward 10 years — and somehow, it might be a good time to revisit it. Now we have LLMs who could somewhat reason about the text we give them and decide what to do. It led me to reread a really good piece by HTMX on <a href=\"https://htmx.org/essays/hateoas/\">HATEOAS</a>, then open ChatGPT and try this little experiment:</p>\n<pre><code>**Me**\nThe goal is to trigger depositing money to an account, \nusing HTTP API calls. At the start, you&#39;re given \nonly the hostname (bank.example.com) \nand the entry-point URL: /accounts/12345. \nYou should give me HTTP requests you&#39;d like \nto make (no words, just HTTP requests). \nI&#39;ll act as a server. And we&#39;ll see if we get the task done.\n\n**ChatGPT**\nGET /accounts/12345 HTTP/1.1\nHost: bank.example.com\n\n\n**Me**\nHTTP/1.1 200 OK\n&lt;html&gt;\n  &lt;body&gt;\n    &lt;div&gt;Account number: 12345&lt;/div&gt;\n    &lt;div&gt;Balance: $100.00 USD&lt;/div&gt;\n    &lt;div&gt;Links:\n      &lt;a href=&quot;/accounts/12345/deposits&quot;&gt;deposits&lt;/a&gt;\n      &lt;a href=&quot;/accounts/12345/withdrawals&quot;&gt;withdrawals&lt;/a&gt;\n      &lt;a href=&quot;/accounts/12345/transfers&quot;&gt;transfers&lt;/a&gt;\n      &lt;a href=&quot;/accounts/12345/close-requests&quot;&gt;close-requests&lt;/a&gt;\n    &lt;/div&gt;\n  &lt;/body&gt;\n&lt;/html&gt;\n\n\n**ChatGPT**\nGET /accounts/12345/deposits HTTP/1.1\nHost: bank.example.com\n\n\n**Me**\nHTTP/1.1 200 OK\n&lt;html&gt;\n  &lt;body&gt;\n    &lt;form method=&quot;post&quot; action=&quot;/accounts/12345/deposits&quot;&gt;\n      &lt;input name=&quot;amount&quot; type=&quot;number&quot; /&gt;\n      &lt;button&gt;Submit&lt;/button&gt;\n    &lt;/form&gt;\n  &lt;/body&gt;\n&lt;/html&gt;\n\n\n**ChatGPT**\nPOST /accounts/12345/deposits HTTP/1.1\nHost: bank.example.com\nContent-Type: application/x-www-form-urlencoded\nContent-Length: 11\n\namount=50</code></pre><p><a href=\"https://chatgpt.com/share/68365c43-61c8-8005-95f2-f6fc8fc814ac\">here is a chatgpt.com-hosted chat transcript</a></p>\n<p>So, basically, HTML here fills all the missing pieces: method, endpoint, schema, everything. No additional docs or schemas. Just HTML. LLM handled other standard HTTP patterns (like <code>401 Unauthorized</code>) all perfectly, no surprises.</p>\n<p>So, here we are. HATEOASy HTML over HTTP might already have everything we need for. And it’s human-readable, and LLM-friendly. It’s not a static doc — tools and flows can change based on context, user input, or app state. It’s not really verbose. You can drop most of the markup (html, body, and other tags), and it&#39;s still totally valid HTML.</p>\n<p>The beauty of it is that the same HTML can serve both as a UI for humans and a tool interface for LLMs. You can load it in your browser, click through it manually, and see exactly what the agent would see. No need for separate dev consoles or special tooling.</p>\n<p>So yeah — turns out old-school HTML over HTTP might just be the most future-proof API format we’ve got. And now with LLM reasoning, HATEOAS might be relevant again.</p>\n<p><em>Update:</em><br>Just after writing the draft for this note, I saw the CEO of HTMX <a href=\"https://bsky.app/profile/htmx.org/post/3lq6pobpjb22j\">bsky&#39;ed about the same thing</a>, referencing his older article from 2016, “<a href=\"https://htmx.org/articles/hateoas-is-for-humans/\">HATEOAS is for Humans</a>”. Well, it&#39;s 2025 and indeed it might be not just for humans anymore.</p>\n",
   "date_published": "2025-05-28T04:51:00+02:00"
  },
  {
   "title": "The 10th month of October",
   "id": "https://mikesub.net/blog/octo10.html",
   "url": "https://mikesub.net/blog/octo10.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/vdnkh.jpg\" alt=\"\"></p>\n<p>Some years ago, I would have listed these as problems that could be solved by now:</p>\n<h2 id=\"seamless-language-translation\">Seamless language translation</h2>\n<p>Babel Fish by Douglas Adams. No matter what language one is writing, another should be able to seamlessly read and understand the written. We do have Google Translate, DeepL and LLMs, some of them even built-in in modern browsers, but they still feel a bit clunky. These tools often fail to translate all the text, and sometimes they break JavaScript interactivity and form submissions. We&#39;re still in the POC stage, not much further.\nSometimes I don&#39;t need to translate the full page, just a section. Some sites offer a &quot;translate&quot; button ((X has it next to a tweet), but that&#39;s not a browser or an OS. It can be much smoother experience.</p>\n<h2 id=\"smart-diffs\">Smart diffs</h2>\n<p>Imagine comparing programming code files not just by lines of text, but by actually analyzing the code— parsing the AST, symbols, and tokens to understand semantics. And no, we don&#39;t need LLMs to predict merges; algorithms can handle that. It might not be perfect, but it would be a game-changing improvement over simply comparing characters and lines.</p>\n<p>Recent links:</p>\n<ul>\n<li><a href=\"https://build-your-own.org/blog/20240813_css_vertical_center/\">2024. CSS has vertical centering</a></li>\n<li><a href=\"https://notebooklm.google/\">Google NotebookLM</a></li>\n<li><a href=\"https://www.theverge.com/2024/9/27/24256361/\">WordPress drama</a></li>\n<li><a href=\"https://erikbern.com/2024/09/27/its-hard-to-write-code-for-humans\">It&#39;s hard to write code for computers, but it&#39;s even harder to write code for humans</a></li>\n</ul>\n<p>Music:</p>\n<ul>\n<li><a href=\"https://music.youtube.com/playlist?list=OLAK5uy_luqjVwyPbpq_jAce9ziu8tKL33SXJF1mQ\">Depeche Mode - Ultra</a></li>\n</ul>\n",
   "date_published": "2024-10-10T02:05:00+02:00"
  },
  {
   "title": "Welcome to the fall",
   "id": "https://mikesub.net/blog/thefall.html",
   "url": "https://mikesub.net/blog/thefall.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/objects.jpg\" alt=\"\"></p>\n<p>One thing that surprised me when I moved to the Netherlands was the difference in how the seasons are observed.\nIt turns out that there are at least two ways: astronomical and calendar-based. I was used to calendar seasons, where\neach season has three months, starting on the first and ending on the last day of the respective months. While some countries use astronomical approach where it&#39;s defined by solstices and equinoxes.\nSo, for me, it&#39;s already autumn, while for you, it might still be summer. Lucky you.</p>\n<p>The first correspondence has arrived! I didn&#39;t expect to get any response to my invitation for letters exchange but it worked. All this blogging is not in vain. Phew. (and EPS FTW!) Actually, at some point in the past, I wondered if anybody was reading these notes. I don&#39;t have any analytics, and I host it via GitHub Pages so I don&#39;t even have access logs or anything. But it seems like someone is out there. Nice. Speaking of access logs, I stumbled upon Caddy, a webserver in Go. It might be slower than nginx, but at least its configs don&#39;t make eyes bleed. That&#39;s worth something, as we all&#39;ve just developed a bit of Stockholm syndrome.</p>\n<p>Caddy was mentioned in a episode of Software Unscripted, where they touched upon why functional languages are less popular than imperative ones. There are many valid reasons, but one interesting observation was that functional languages make easy things a bit harder, while making hard things easier. And most people don&#39;t care about the hard stuff. I totally agree that they make hard things made easier, but I&#39;m not so sure about easy things becoming harder. Are while/for loops really easier to write than a recursion? Who wouldn&#39;t like more uniform, predictable and easier syntax? Who would, in the right mind, avoid immutability? To me, it all just feels like not much more than a mix of bad luck, timing, marketing. And people are known for using inferior tools and that&#39;s totally fine. Look at Tailwind CSS.</p>\n<p>Speaking of which and the broader frontend, I got immersed in it at the beginning, didn&#39;t know anything outside and thought everything was fine as it could and should be. Then I learned about other approaches, saw how things are handled in other languages and understood the point that frontend is quite a mess. Then I stepped away from coding, gained some distanced and my opinion transformed into more humble one — of course, there are issues but nothing critical, it&#39;s just a matter of taste and preference, really. Recently, though, I got my hands back on coding and took a shower of multi-gigabytes of node_modules, complexities of compilation tools, a zoo of bundlers, multiple standards of, hey, importing modules. DHH, talking about this year being the year of Linux on the desktop, mentioned that &quot;if you&#39;re able to figure out how to setup a modern build pipeline for JavaScript or even correctly configure IAM for AWS, you already have all the stamina you need for the Linux journey. Think about giving it another try. Not because it is easy, but because it is worth it&quot;. So, what is figuring out a modern JS build pipeline really worth for?</p>\n<p>Links:</p>\n<ul>\n<li><a href=\"https://github.com/nodejs/loaders/issues/217\">TypeScript support in Node.js</a></li>\n<li><a href=\"https://www.instantdb.com/\">InstantDB</a></li>\n<li><a href=\"https://caddyserver.com/\">Caddy</a></li>\n<li><a href=\"https://pod.link/1602572955\">Software Unscripted podcast</a></li>\n<li><a href=\"https://world.hey.com/dhh/\">DHH</a></li>\n</ul>\n<p>Music:</p>\n<ul>\n<li><a href=\"https://nickcave-badseeds.ffm.to/wild-god\">Nick Cave &amp; The Bad Seeds — Wild God</a></li>\n</ul>\n",
   "date_published": "2024-09-10T17:00:00+02:00"
  },
  {
   "title": "Midsummer 2024",
   "id": "https://mikesub.net/blog/midsomar.html",
   "url": "https://mikesub.net/blog/midsomar.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/harvest.jpg\" alt=\"\"></p>\n<p>I decided to extract a blog engine from my blog repository, even though nobody asked for it. While doing so, I dropped TypeScript but moved \nit Deno for the rest of the tooling. There&#39;s nothing particularly interesting about this, except for one thing I noticed: If I decide to \npublish this for others to use, it could be as simple as just cloning a repository and periodically rebasing it on my remote origin. \nNo need for package managers or anything else. You just clone, configure, add content, it&#39;s all gitignored. You only need to pull updates \noccasionally. I love this simplicity, although I&#39;m not sure if I&#39;ll actually publish it.</p>\n<p>The same simplicity attracted me in <a href=\"https://pocketbase.io/\">PocketBase</a>. It’s a Go executable with embedded WAL-enabled SQLite, providing REST APIs out of the box, \nalong with a pretty nice admin dashboard interface. A backend in 1 file. If you need to extend it, you just add properly named files next to it. To deploy, \nyou simply copy this one file to your server, and you have everything you need for a small-scale web service backend. No Docker, no pods.</p>\n<p>Other interesting links I stumbled upon:</p>\n<ul>\n<li><a href=\"https://www.keithcirkel.co.uk/css-classes-considered-harmful/\">CSS Classes considered harmful</a></li>\n<li><a href=\"https://www.404media.co/email/4650b997-7cc3-4578-834c-7e663ed3d516/\">Google&#39;s Exclusive Reddit Access</a></li>\n<li><a href=\"https://alttextselfies.net/selfies/\">Alt Text Selfies</a></li>\n<li><a href=\"https://playhtml.fun/fridge.html\">Fridge Poetry</a></li>\n</ul>\n<p>Last two come from <a href=\"https://tinyawards.net/\">Tiny Awards</a>. A wonderful thing on its own.</p>\n<p>Music:</p>\n<ul>\n<li><a href=\"https://music.youtube.com/watch?v=bEBV7hNh3MM&amp;si=ZeBQdALv2BEhuy2G\">Leonid Fyodorov — Mir</a> </li>\n<li><a href=\"https://music.youtube.com/watch?v=37kjXWxGQGU&amp;si=PwZ6zCHvPBSCoV2E\">The Crazy World Of Arthur Brown</a></li>\n</ul>\n<p>See you in Fall!</p>\n",
   "date_published": "2024-08-15T23:00:00+02:00"
  },
  {
   "title": "A blog entry",
   "id": "https://mikesub.net/blog/2407.html",
   "url": "https://mikesub.net/blog/2407.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/40yo.jpg\" alt=\"\"></p>\n<p>Quitting social media is like quitting smoking — easy, done it several times.</p>\n<p>E-mail correspondence I suggested in my previous update didn’t really work out. Not that I expected it to. So here are some links I found interesting recently:</p>\n<ul>\n<li><a href=\"https://escapethealgorithm.substack.com/p/should-this-be-a-map-or-500-maps\">A story</a> how on 1700s Spanish King ordered to an accurate map of the kingdom and that resulted in 500 different maps.</li>\n<li><a href=\"https://www.sanfordhealthplan.com/-/media/files/documents/providers/clinical-resources/cms-quality-adult_adhd_self_report_screener_new_2012.pdf\">WHO Adult ADHD Self-Report Scale</a></li>\n</ul>\n",
   "date_published": "2024-07-12T02:30:00+02:00"
  },
  {
   "title": "Disenchantment",
   "id": "https://mikesub.net/blog/disenchantment.html",
   "url": "https://mikesub.net/blog/disenchantment.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/2d745cd0a60c491bb7c701cc1ecdf8ded120fbea/photos/tv_dinner.jpg\" alt=\"\"></p>\n<p>No updates here for a long time. And 2023 has ended, so why not to journal some results. Then I saw others&#39; posts online and realized I would be writing roughly the same, and for some reason, it stopped me. Then, having found no rationale why not to, I thought it still was worth writing about the disenchantment which feels now not transient but getting deeply rooted.</p>\n<p>It probably all began during the pandemic, with disenchantment in governments and states in general. Then it was affirmed and intensified due to the war. This year, I keenly felt it from social media and from the internet. At some point, I realized that I gain no interest and knowledge reading my RSS subscriptions, with rare exceptions. I didn&#39;t renew my FeedBin and didn&#39;t notice much difference. I did transfer a couple of subscriptions to email and that&#39;s it. I tried to read books and listen to audio versions more. Not a strong habit yet but feels much better in comparison.</p>\n<p>Also, I decided to try to transform email into what it used to be. You receive a letter, sometimes a long one, and you read it with interest, instead of an impersonal stream of spam in the form of updates for the sake of updates and news for attention-grabbing.\nSimultaneously, I took a break from Twitter, which was the only social media I used. In the beginning, I tried moving to Mastodon, found no one there, and eventually quit both.\nBut to feel all this more vividly, I had to return to Twitter in December to sense this contrast. What a place!</p>\n<p>At the same time, there are no hopes and expectations for 2024. As Dan The Stranger said, at best, it will be average. The only thing I find interesting to follow now is Argentina, but as they reminded us recently on the Reason podcast: all politicians are garbage and will disappoint you in the end.</p>\n<p>So how about your 2023 and 2024 plans? Let&#39;s start a correspondence?</p>\n",
   "date_published": "2024-01-10T14:25:00+01:00"
  },
  {
   "title": "Swamp surf",
   "id": "https://mikesub.net/blog/swamp_surf.html",
   "url": "https://mikesub.net/blog/swamp_surf.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/car.jpg\" alt=\"\"></p>\n<p>I&#39;m afraid of being that bear to the gardener, but let&#39;s talk about burnouts.</p>\n<p>Good things first. Burnout is not a stable condition. Once you remove yourself from the environment that caused it, you recover. I did. I even got curious about the work again. A thought of returning too soon and spoiling the time spent recovering was quite scary. At the same time, it was tempting to try to ride that motivation wave of curiosity to get back. In my case the timing was right. Trusting yourself worked. </p>\n<p>It was clear that the wave would give me only that initial boost. Then I would have to jump from a board into good old surroundings which had once caused all that. What worked for me was resetting my goals and taking on projects with defined success metrics and intermediate milestones. All of them should be like that, right? Pause here and check yours. </p>\n<p>Instead of following a schedule of slowly increasing load, I worked when I felt like I was making progress. I believe that&#39;s crucial. If you stop feel yourself efficient and stop relating to what you do, it quickly becomes a slippery burning slope.</p>\n<p>It all happened in 2022. It&#39;s now 2023 and I feel I&#39;ve managed to move on from burnout. Insights are unsurprising. Keep questioning yourself what you do and what sense it makes. Work-life balance is somewhat a hoax. You burn out not because you forget about this balance. Having ideally time-boxed 4-6-8 hours of meaningless work would burn you out quicker than you might think. And that&#39;d be strange if it were different when you spend most of your time on something you don&#39;t really like and where you don&#39;t feel yourself efficient. Finding motivating and fulfilling projects helps. If you can&#39;t find that in your current job, it may be time to consider a change.</p>\n",
   "date_published": "2023-04-05T02:50:00+02:00"
  },
  {
   "title": "Buying CDs in 2020",
   "id": "https://mikesub.net/blog/buying_cds.html",
   "url": "https://mikesub.net/blog/buying_cds.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/curtains.jpg\" alt=\"\"></p>\n<p>Around 8 years ago I started to buy vinyl records. It wasn’t for the vinyl audio quality. The idea was to have the most favourite albums in physical format. I did not even have a record player. I thought of getting one at some point but the goal was to have records on a shelf. I could stream the music online while sitting in the chair and enjoying a rich booklet of a deluxe edition with photos, lyrics and additional materials.</p>\n<p>Later I got an amplifier and bookshelf speakers. There was room for extending the system with a record player, but at the same time it worked alright with a computer as the source. Recently, years later, I finally got a turntable. And the whole world of complexity crushed upon me. Records are not the most convenient format to start with: they’re heavy, need care to store, act as dust magnets. But the hardware added even more: pre-amps, the world of cartridges, fine-tuning the player itself (tonearms, counterweights), electric issues resulting in humming and/or hissing sounds, the space it takes, sound quality degradation due to scratches. And it looks like you need to clean/wash records which seems to be the ritual in itself. Yes, it could be all simpler and some of those things you might successfully skip or don’t have problems with, but they’re there still. Some would say that’s the essential part of the experience and they would be true. But not for me, so I thought whether I could keep that physical aspect but avoiding all the complexity mentioned? It turned out humans invented CDs just for that.</p>\n<p>But there was a reason why I hadn’t considered them originally. Opposed to vinyl, I was there when CDs were the staple format. And around me, all CDs were from pirates: faceless jewel cases, no booklets. I didn’t see many digipaks, didn’t know what’s the deal with deluxe/limited editions. They were better than cassettes (which I started my audio experience with) but I didn’t think twice about abandoning them for mp3 collections, first, again on pirate CDs and then on iPod. And vinyl was before my times. And I skipped cheap mass editions of it. All I saw were gorgeous editions made for collectors and fans as everybody consumed mp3 anyway.</p>\n<p>Overall, if we put aside audiophile discussions, CDs seem to be better plainly better. The hardware is easier to deal with, they’re cheaper, easier in care and you still have a booklet to look through and enjoy. Yes, it&#39;s 9 times smaller in size but given how much hustle and pain is avoided it seems worth it. And now some deluxe editions could be literally books so sometimes you don’t even really lose much. Oh, and you always can backup your CD and then burn it again, it gets hidden inside the player anyway so not a big deal.</p>\n<p>So I returned the turntable and sold the amp. I didn’t need a pre-amp anymore, it had some other compromises and I thought of getting something more compact. Ideally, I’d sell speakers too but it turns out if you want a one-piece CD player it&#39;s hard to find anything more serious than a kids CD boombox. Everything else is modular so I kept the speakers. As you might have noticed, I’m not that into sound quality. Yes, I’d not use a $50 boombox but I don’t need a $5k system either. And for me it&#39;s totally fine to have a CD transport, a DAC and an amp all combined in one unit. And it turns out they still produce them and call them CD receivers. They all have radio for some reason which I’d remove but apart from that they’re almost ideal: restrained design, physical buttons, tactile experience, dot-matrix display, no thrills. It feels so good. Much better and more reliable than any software from the industry giants for sure.</p>\n<p>So now I’m slowly selling my vinyl and already ordered a couple of CDs. Who would have thought?</p>\n<p>And by the way, it looks like there will be the fourth episode of &quot;sick of it all digital&quot;. The first one was about <a href=\"https://mikesub.net/blog/spoilers.html\">VHS vs. Netflix</a>, the second was about <a href=\"https://mikesub.net/blog/unknowns_and_surprises.html\">film photograpy</a>.\nAnd I&#39;m already reading about analog watches.</p>\n",
   "date_published": "2020-11-13T01:30:00+01:00"
  },
  {
   "title": "The setup",
   "id": "https://mikesub.net/blog/setup.html",
   "url": "https://mikesub.net/blog/setup.html",
   "content_html": "<p>I&#39;ve just realised that <a href=\"https://www.theolognion.com/programmer-starts-a-blog-doesnt-write-about-their-static-site-generator-setup-in-the-first-post/\">Joanne Dvorak</a> might be not the only one to make such mistake.</p>\n<p>So let me fix it. I&#39;ve never been a fan of write-your-own-thing when there are many superior alternatives available. Now I’m even less of it. But when I decided to spin up a stand-alone blog, I didn’t go for Hugo, Gatsby or Jekyll. I thought it’s just a bunch of static pages, right. If you add some basic scripts for automation so you don’t need to update a RSS file manually and don’t copy-paste a HTML header, you should end up in less than a hundred lines of code. That probably should take less than reading through docs and configuring something ready-made. Well, I’ve ended up in <a href=\"https://github.com/mikesub/mikesub.net/tree/master/src\">~150</a>.</p>\n<p>To be fair, it has dependencies on Date-fns, Lodash, Mustache and Meta-marked. In theory, I could have gone without first two. That would increase the size, of course. Mustache and Meta-marked (a markdown library) is harder to remove but at the same time I could make it as an independent external process in the build system, not depending on node-modules implementation. It seems to be an overkill, I&#39;m not a purist in this regard.</p>\n<p>One thing I&#39;m very pleased with is how tests are done. There are none of them. I&#39;ve just made it work once by manual testing, then results (htmls and feeds) got pushed to Git and from that moment I just re-run builds and check Git diff. No changes, no regression. I like it. Snapshot testing, haha.</p>\n<p>The blog comes with a dark mode, human date formatting, drafts, RSS and JSONFeed.</p>\n<p>As for the deploy, I just push changes to GitHub. Hosting comes for free from GitHub at the moment. The only thing I’m paying for is the domain name.</p>\n<p>It misses a favicon, I&#39;ll make it eventually. Also I planned to add tags when I got enough posts, but with the current pace I have few more years for that.</p>\n<p>Now you know.</p>\n",
   "date_published": "2020-09-03T23:31:00+02:00"
  },
  {
   "title": "Unknowns and surprises",
   "id": "https://mikesub.net/blog/unknowns_and_surprises.html",
   "url": "https://mikesub.net/blog/unknowns_and_surprises.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/self_grass.jpg\" alt=\"\"></p>\n<p>For most of my years in photography I’ve been using digital cameras. I bought film cameras a few times just to play around with the film but always sold it back after several months. And I never got into analogue printing, just developing and scanning with DSLRs.</p>\n<p>Around three years ago I found a full darkroom set for sale and decided to experience the complete process. It costed almost nothing and contained everything you might need. There was even some film in bulk rolls. But then it had to wait for two more years in my storage room until I finally found space and time to try it out.</p>\n<p>So I started with a bulk roll can marked Ilford FP4 (without plus) which I knew nothing about. Wikipedia says it was discontinued in 1990. I didn’t even know whether it had some film inside or not. Few empty cassettes were there as well so I barricaded in my bathroom and opened a can. The can contained some film but I couldn’t tell how much of the original 17 meters. Also, I was not sure was it FP4 to start with and how expired it was. W/o any precision, spreading my arms to measure the length, I loaded my first cassette and put it in my freshly obtained Olympus XA2.</p>\n<p>It resulted in 30 something frames. I’m not a quick shooter so even for testing purposes it took me several weeks to finish the roll. During all that time I was not sure what I’m shooting on. The untested camera also gave me some doubts. Then it came to development which neither I have much experience nor it was clear how to develop such expired film. But in the end, it all turned out quite ok. It was FP4 indeed, ISO was right, the camera worked, Rodinal did its job.</p>\n<p>And this bulk roll helped me to realise that these unknowns, surprises, inaccuracies, delays in seeing results, shooting a roll and being not sure whether it would work at all... photography seems to be a significantly incomplete experience for me without it.</p>\n",
   "date_published": "2020-09-02T02:30:00+02:00"
  },
  {
   "title": "Spoilers for unknowns",
   "id": "https://mikesub.net/blog/spoilers.html",
   "url": "https://mikesub.net/blog/spoilers.html",
   "content_html": "<p>I was born in late USSR. Some things, somewhat ordinary to Western World, were either in scarcity or just not existing in my childhood. Though my uncle emigrated to Australia so occasionally we were getting something from there. At some point, we got a VHS. The player came with a bunch of cassettes with movies recorded from Australian TV. Sometimes they were re-recorded. And in this case, if the original film was longer than a new one, you got an additional ending of something unknown after the closing credits.</p>\n<p>It was mostly action movies there. So imagine, you’ve just finished watching The Temple of Doom or Romancing the Stone and you get a bonus. Most often those last 10-15 mins were either a final fight or, if you’re not lucky, a happy ending when the main hero has already won the fight and escaped with his woman.</p>\n<p>But you skipped everything before. And there is no way even to know the movie title. You don’t know who they are and where they are. How many secondary characters have died by that moment, or captured or trapped and about to be either smashed by some ticking mechanism or their cage is slowly going into open space or lava. Why does the main hero have only an ancient melee weapon in his hands and why is he all in some sort of grease. You could just imagine.</p>\n<p>But that was the climax, sometimes the most expensive part, so you skim it off the top. And then came the closure with all the freeing of hostages, escaping from the bunker by grabbing a helicopter rope ladder.</p>\n<p>Later I discovered some of those movies. Many stayed in my memory like that, I guess, for ever. But that was a fun experience.</p>\n<p>Beat that, Netflix.</p>\n",
   "date_published": "2020-08-09T01:40:00+02:00"
  },
  {
   "title": "Intermission",
   "id": "https://mikesub.net/blog/intermission.html",
   "url": "https://mikesub.net/blog/intermission.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/flower_thrower.jpeg\" alt=\"\"></p>\n<p>Obviously, it turned out harder than expected. My plans to go through all my photos year by year stalled on year #2 (2006).\nI haven&#39;t picked a photo and finished the note but already have an external HDD dead, recovered data from backups,\ndisassembled proprietory photo libraries, found a way to export photos from Lightroom CC (which doesn&#39;t have Export\noption), removed dedupes after merging inconsistently structured backups (better than none) and so on.</p>\n<p>Computers.</p>\n<p>Meanwhile, new photos keep appearing. This one I&#39;ve just taken yesterday. It&#39;s probably too early to share it\nbut I feel the need to fill that intermission.</p>\n",
   "date_published": "2020-01-26T16:20:00+01:00"
  },
  {
   "title": "Oh five",
   "id": "https://mikesub.net/blog/2005.html",
   "url": "https://mikesub.net/blog/2005.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/escalator.jpg\" alt=\"\"></p>\n<p>There is no better than to start from 2005. I borrowed a <a href=\"https://www.dpreview.com/reviews/minoltadimagea1\">Minolta DiMAGE A1</a> from a friend and started shooting. That was my first exposure into digital photography and photography in general apart from few episodes in my childhood.</p>\n<p>Obviously, there is nothing worth sharing from these times, now it all seems very primitive and full of mistakes, but that was arguably the most exciting time: constant learning, a-ha moments, experiments, not knowing a thing, that was fantastic.</p>\n<p>And this is a shot of a man on a escalator in Moscow metro. The original was lost, all I have this 600x450 processed for web. But that might be even better, that shows that all I knew at that moment was a pair of brightness and contrast sliders.</p>\n",
   "date_published": "2019-12-09T16:20:00+01:00"
  },
  {
   "title": "Django cards",
   "id": "https://mikesub.net/blog/django_cards.html",
   "url": "https://mikesub.net/blog/django_cards.html",
   "content_html": "<p><img src=\"https://media.githubusercontent.com/media/mikesub/mikesub.net/master/photos/window.jpg\" alt=\"\"></p>\n<p>If you take metro and stand facing doors, it might feel as if the train goes straight without turns. Though if you look back and the previous car can be seen, you&#39;ll notice that it&#39;s wriggling from side to side.</p>\n<p>That&#39;s what I ended up with while trying to describe my interests in creativity. To capture and share such moments, mostly by photography now, occasionally by text. So at first, it was some DIY weblog, then I moved to LiveJournal. Later it was Flickr, then Instagram until it all froze in early 2018. Since then I&#39;ve been thinking how to do it right. All social networks or standalone portfolio/blogging web platforms didn&#39;t appeal to me. It was either focused on different goals or just too noisy. Also, I didn&#39;t stop thinking of what to do with photographs being just a sub-second glimpse on your displays.</p>\n<p>So here is another attempt. Now here.</p>\n<p>There are several ways to follow:</p>\n<ul>\n<li>Support me at <a href=\"https://patreon.com/djangocards\">Patreon</a> and get printed photographs every quarter.</li>\n<li> Use <a href=\"https://mikesub.net/blog/rss.xml\">RSS</a> or <a href=\"https://mikesub.net/blog/feed.json\">JSON Feed</a> to follow online</li>\n<li> Join Telegram Group to discuss published notes and give any feedback. Contact me for the link at <a href=\"https://telegram.me/mikesub\">@mikesub</a></li>\n</ul>\n<p>Oh, and I&#39;d like to mention recent findings that helped me to decide: <a href=\"https://www.theredhandfiles.com/\">The Red Hand Files</a> by Nick Cave and <a href=\"https://brandur.org/sequences-project\">Sequences</a> by Brandur Leach. Check them out. And let&#39;s start.</p>\n",
   "date_published": "2019-12-05T14:15:00+01:00"
  },
  {
   "title": "A Case of SSR",
   "id": "https://mikesub.net/blog/ssr.html",
   "url": "https://mikesub.net/blog/ssr.html",
   "content_html": "<p>If we take popular JS topics currently out there, type annotations, server-side rendering (SSR) and CSS in JS are probably in the top four. Virtual DOM frameworks have come as a solution to a request of getting more code on a client side. Tools like TypeScript and Flow appeared as attempts to fix some JS parts. Also, people started to seek for ways how not to duplicate ‘view’ code between server and client. Most often it leads to running JS in Node.js on server, which comes with <a href=\"https://solovyov.net/en/2017/server-side-rendering/\">‘restart every N requests’</a> and other implications. But people still go there to serve content faster. And it&#39;s obvious — why to take away from browsers what they do best: parsing and rendering HTML pages. And so now it&#39;s even supported by many frameworks out of the box.</p>\n<p>But do you need all that? Do you need to add SSR to your React (insert any other Virtual DOM framework) application? Given the complexity it brings, I would say often ‘no’ and let me elaborate on that.</p>\n<p>To show a ‘loading’ screen and do everything client-side would be much easier. Yes, it would drastically increase first page load time but if you deal with application-type website, sometimes it&#39;s acceptable. To mitigate drawbacks, there are few techniques to hack the perception of this loading time. For example, you can show placeholders for content, preparing users for actual things to appear.</p>\n<p><img src=\"https://mikesub.net/blog/images/content-placeholder.png\" alt=\"Content placeholder\"></p>\n<p>BUT HEY NO, not acceptable. It can be done better. We have service workers, critical path render techniques, all those are at our disposal. And nothing&#39;s wrong with using node.js.</p>\n<p>But then there is a thing. The markup you&#39;d prepare on server will be static (sic!). It&#39;s a safe bet to assume that all event listeners would be attached after DOM is parsed, rendered and your JS bundles are downloaded, parsed, interpreted. And it leads to showing static markup of something intended to be dynamic, breaking UX right from the first interaction.</p>\n<p>So it&#39;s possible that ‘loading’ screen, fully functional, yet empty is not that bad if you can&#39;t do the other option right. To show perfectly-looking tabs which are not clickable is just ignorant.</p>\n<p><img src=\"https://mikesub.net/blog/images/ns-wifi.png\" alt=\"NS wifi splash screen\"></p>\n<p>That&#39;s a splash screen for wifi on Dutch railways. The connection is often flaky as there are many devices online and cell coverage is also spotty sometimes. And so I see a page, but can&#39;t switch to a tab I need. And yes, probably it doesn&#39;t even use React, it&#39;s actually an illustration to already forgotten ‘Unobtrusive JS‘ thing, but it&#39;s the same issue.</p>\n<p>Unobtrusive JS is still the right approach. But it adds so many things to take care of, so it&#39;s very tempting to disregard it. Hey, it loads blazingly fast on my machine, and yes, I will wait few seconds before clicking anywhere just because I know that this button, even though already rendered, won&#39;t be responsive for a while. So what should I do? Right, let&#39;s move everything to JS so there is no static markup to break. Then we got loading state and we get back to square one with going SSR.</p>\n<p>As always there is a third option. And it can help to escape that loop: to serve content in chunks and to send parts of JS with every chunk, progressively build a page with atomic blocks, but that brings you problems with shared dependencies and some others</p>\n<p>(╯°□°)╯︵ ┻━┻</p>\n<p>So going SSR, first of all, you need to solve how not to show broken interface while not everything is ready to interact. And don&#39;t ignore that as network is slow, unpredictable and with few guarantees.</p>\n",
   "date_published": "2019-03-07T17:40:00+01:00"
  },
  {
   "title": "Types. String semantics",
   "id": "https://mikesub.net/blog/types_string_semantics.html",
   "url": "https://mikesub.net/blog/types_string_semantics.html",
   "content_html": "<p>That&#39;s the third article in a series on TypeScript started by ‘<a href=\"https://mikesub.net/blog/ts_bad_parts.html\">TypeScript. Bad Parts</a>’. You can read them in any order as they aren&#39;t really connected apart from covering the same topic. But if you can&#39;t decide, make it <a href=\"https://mikesub.net/blog/ts_bad_parts.html\">chronologically</a>.</p>\n<p>This time I&#39;d like to show how you can leverage types to simplify your runtime code.</p>\n<p>Let&#39;s say we have a function which calculates a flag&#39;s value based on some input. And later you use that flag to do some checks. The easiest way to write that could be something like that:</p>\n<pre><code class=\"language-javascript\">function calculateFlag(conditions) {\n  return &quot;important&quot;;\n}\n\nconst flag = calculateFlag(context);\nif (flag !== &quot;important&quot;) {\n  /* ... */\n}</code></pre>\n<p>That would work but it&#39;s error-prone and your colleagues might signal you about it during a code review. It turns out that neither any editor nor javascript itself knows much about your flags and what values are valid there, for them it&#39;s just strings, nothing more. That&#39;s why they can&#39;t help you much in refactoring or spot a typo if you misspell a value in one of the places. The common JS pattern to mitigate that is to use an object as a poor-man enum.</p>\n<pre><code class=\"language-javascript\">const flags = { important: &quot;important&quot; };\nfunction calculateFlag(conditions) {\n  return flags.important;\n}\nconst flag = calculateFlag(context);\nif (flag !== flags.important) {\n  /* ... */\n}</code></pre>\n<p>You have your value in one place, it&#39;s easier to change it, editors might warn you if you make a mistake in accessing an inexistent property, all good. But that brings a small penalty that you introduce an object where your runtime doesn&#39;t need one. It&#39;s small enough not to care at all, benefits outweigh that clearly. Though nobody would object if some pre-compiler inlines it away as it doesn&#39;t possess any runtime value in itself.</p>\n<p>With types, you can add that semantics to your code that it&#39;s not just a random string without adding any objects and keeping it as strings.</p>\n<pre><code class=\"language-typescript\">type Flag = &quot;important&quot;;\nfunction calculateFlag(conditions): Flag {\n  return &quot;important&quot;;\n}\nconst flag = calculateFlag(context);\nif (flag !== &quot;important&quot;) {\n  /* ... */\n}</code></pre>\n<p>Now it knows that your function returns that value (in real life it should be a union of several valid strings) and it can check whether your <code>if</code> later makes any sense.</p>\n<p>I see it as a nice example of adding more expressiveness to the language. One can argue that implementing such checks using built-in features like a plain object is even better. But I do see some value in using separate construct for these needs. Having fewer concepts is better in terms you should not have too many of them. Otherwise, it would be too low-level.</p>\n<p>Another take on that (and actually the original premise of that note) is that I tend to use TypeScript solely as a type annotations system and try to avoid any additional features it brings and enums is one of them. And so this example is a nice one to demonstrate that you don&#39;t need enums for that, just use a union type and you&#39;re good. Hello, <code>flag.isImportant()</code>.</p>\n<hr>\n<p>That&#39;s the third article in a series on TypeScript. You can read them in any order as they aren&#39;t really connected apart from covering the same topic:</p>\n<ul>\n<li><a href=\"https://mikesub.net/blog/ts_bad_parts.html\">TypeScript. Bad Parts</a></li>\n<li><a href=\"https://mikesub.net/blog/types_runtime_checks.html\">Types and runtime checks</a></li>\n</ul>\n",
   "date_published": "2019-03-06T10:08:00+01:00"
  },
  {
   "title": "Types and runtime checks",
   "id": "https://mikesub.net/blog/types_runtime_checks.html",
   "url": "https://mikesub.net/blog/types_runtime_checks.html",
   "content_html": "<p>That&#39;s the second article in a series on TypeScript started by ‘<a href=\"https://mikesub.net/blog/ts_bad_parts.html\">TypeScript. Bad Parts</a>’. You can read them in any order as they aren&#39;t really connected apart from covering the same topic. But if you can&#39;t decide, make it <a href=\"https://mikesub.net/blog/ts_bad_parts.html\">chronologically</a>.</p>\n<p>So what do types bring to JS? They fix some bad parts of JS, but that&#39;s a byproduct. Mainly they add some semantics to code which helps editors and people to get more sense what it&#39;s doing, how it should work and also spot some things which can be optimised. Let me show-case that with several examples.</p>\n<h2 id=\"runtime-checks\">Runtime checks</h2>\n<p>Say, we have a function which takes a configuration object, which is a JS way to have named arguments, and it really needs <code>url</code> out of it.</p>\n<pre><code class=\"language-javascript\">function main({ url }) {\n  // ...\n}</code></pre>\n<p>It can not do a thing without <code>url</code>, no fallback or default value possible. So there are two options, either to exit silently returning <code>undefined</code> or, to make it more explicit, to throw an error:</p>\n<pre><code class=\"language-javascript\">function main({ url }) {\n  if (!url) {\n    throw new Error(&quot;no URL provided&quot;);\n  }\n  // ...\n}</code></pre>\n<p>That should work. If somebody fails to put URL there, they notice it ASAP. But since it&#39;s not really named arguments there but just a fake, the code might fail even before. If one doesn&#39;t provide an object at all, we&#39;ll get:</p>\n<pre><code>TypeError: Cannot destructure property `url` of &#39;undefined&#39; or &#39;null&#39;.</code></pre><p>Let&#39;s not discuss the fact that my Chrome can&#39;t decide what it gets there: null or undefined, and try to fix that.</p>\n<pre><code class=\"language-javascript\">function main({ url } = {}) {\n  if (!url) {\n    throw new Error(&quot;no URL provided&quot;);\n  }\n  // ...\n}</code></pre>\n<p>Now it&#39;s better. Though now it looks stupid. We&#39;ve just provided a fallback value to be able to throw an error which can not be caught and recovered from.</p>\n<p>And that&#39;s all happening in runtime. The code is there: parsed, evaluated, running, though isn&#39;t helping at all. If you use type annotations you can prevent that thing before runtime.</p>\n<pre><code class=\"language-typescript\">function main({ url }: { url: string }) {\n  // ...\n}</code></pre>\n<p>Instead of providing a default value and throwing an error, we state that the argument is required and it needs to have <code>url</code> key which is a string. That&#39;s not ideal as any string, even empty one, will pass. But TypeScript might evolve to it at some point: <a href=\"https://github.com/Microsoft/TypeScript/issues/6579\">regex-validated string type</a>. And as of now, we&#39;re already preventing some errors w/o any runtime costs.</p>\n<hr>\n<p>That&#39;s the second article in a series on TypeScript. You can read them in any order as they aren&#39;t really connected apart from covering the same topic:</p>\n<ul>\n<li><a href=\"https://mikesub.net/blog/ts_bad_parts.html\">TypeScript. Bad Parts</a></li>\n<li><a href=\"https://mikesub.net/blog/types_string_semantics.html\">Types. String semantics</a></li>\n</ul>\n",
   "date_published": "2019-03-01T18:00:00+01:00"
  },
  {
   "title": "TypeScript. Bad Parts",
   "id": "https://mikesub.net/blog/ts_bad_parts.html",
   "url": "https://mikesub.net/blog/ts_bad_parts.html",
   "content_html": "<p>I&#39;ve been writing TypeScript for more than a year now and gone through well-known five stages of grief so it&#39;s time to share my experience. It all started as a compilation of tips &amp; tricks I&#39;ve discovered so far. Then it went to a more meta level of what types bring to JS at all. And as I was writing two pieces asynchronously I began to find myself noticing ‘bad’ parts here and there. At some point, there were enough of them for a separate discussion. So to keep those original ideas free of them, here they are, unordered.</p>\n<h2 id=\"slowness\">Slowness</h2>\n<p>Everything is pointing out it could be considerably faster. I should admit it&#39;s slow but stable so if authors had to choose between those, they did the right choice, but hey, it&#39;s v3 already, maybe it&#39;s time to address that.</p>\n<h2 id=\"cryptic-error-messages\">Cryptic error messages</h2>\n<p>They are. When you rely much on type inferring, it&#39;s even worse. Basically, they are generic stack traces which most of the times I see in a hint window in VSCode. They&#39;re not alone, some other languages are also known for it, but that&#39;s not an excuse.</p>\n<h2 id=\"types-vs-interfaces\">Types vs. interfaces</h2>\n<p>As of TS v3, I don&#39;t see any difference in them, practically speaking. Yes, interfaces can be extended and merged but differences are so subtle so it adds more confusion in the current state of things than benefits.</p>\n<h2 id=\"const-enums\">Const enums</h2>\n<p>If you prepend enum declaration with <code>const</code> the compiler inlines it without creating an object. I can&#39;t see why I have to make that choice, the compiler has all the knowledge (actually even more than me) to decide whether it makes sense or not.</p>\n<h2 id=\"index-signatures\">Index signatures</h2>\n<p>In JS you can put anything as a key in object and it will be converted to a string. TS decided to improve that a bit and allows <code>{ [key: number]: boolean }</code>. Basically, it points that even though key is to be coerced to a string, let&#39;s check that we pass only numbers here. But then we get these:</p>\n<pre><code class=\"language-typescript\">type A = { [k: number]: any };\nconst a2: A = { 2: true }; // alright\nconst a1: A = { string: true }; // error, fine\nconst a3: A = { &quot;2&quot;: true }; // no error?\n\ntype B = { [k: string]: any };\nconst b1: B = { string: true }; // alright\nconst b3: B = { &quot;2&quot;: true }; // no error, fine\nconst b2: B = { 2: true }; // no error?</code></pre>\n<p>And <code>Object.keys()</code> is not a generic, because it can&#39;t be as it always returns strings. The coercion was irreversible, nobody can convert strings back to original types for you. You&#39;re alone.</p>\n<pre><code class=\"language-typescript\">Object.keys(); // {} =&gt; string[]</code></pre>\n<p>And the last, not the least, is that you can only use primitives there, not your own types:</p>\n<pre><code class=\"language-typescript\">type Id = number;\ntype Item = { id: Id };\ntype Index = { [k: Id]: Item }; // nope, number please</code></pre>\n<h2 id=\"type-inference\">Type Inference</h2>\n<p>That&#39;s nice. You feel good when you can drop obvious cases. It feels like language has done its homework. But then it starts taking defaults when there are multiple options and now you should be aware of them.</p>\n<pre><code class=\"language-typescript\">const x = [2, true];\n// (number | boolean)[], not [number, boolean]</code></pre>\n<p>And when you return different shapes of objects from a function (say, redux reducer), inference creates monsters.</p>\n<pre><code class=\"language-typescript\">function foo(x: boolean, arr: []) {\n  if (x) {\n    return { a: true, &quot;3&quot;: 2 };\n  } else {\n    return { b: 2, 3: arr.length };\n  }\n}\n// Inferred: {&#39;a&#39;: boolean; &#39;3&#39;: number; &#39;b&#39;?: undefined;}\n//           | {&#39;bar&#39;: number; 3: 0; &#39;a&#39;?: undefined}\n//\n// Meant to be: {a?: boolean; &#39;3&#39;: number; b?: number;}</code></pre>\n<p>Possible solution might be to add strict check similar to disabling implicit ‘any’ to avoid this monsters guessing and fail to infer when it is ambigious.</p>\n<h2 id=\"global-scope\">Global scope</h2>\n<p>If you write TS for a browser, thus adding <code>dom</code> in <code>compilerOptions/lib</code>, lots of useful types become available in the global scope. And you don&#39;t need to import them explicitly. You know what it means. And they aren&#39;t grouped into a namespace. Yup.\nSome are easy to expect as <code>XMLHTTPRequest</code> but others have more abstract names: <code>AlignSetting</code>, <code>Transport</code>. You will notice errors if you would try to define them in your code:</p>\n<pre><code class=\"language-typescript\">type Transport = ...;\n// duplicate identifier, was already declared in dom.d.ts</code></pre>\n<p>But you might miss the error if you just forget to define it and thus built-in will be used. And even worse will happen if you clash with built-in interfaces, as they will be merged:</p>\n<pre><code class=\"language-typescript\">interface Account {\n  foo: &quot;bar&quot;;\n}\nlet x: Account = { foo: &quot;bar&quot; };\n// missing displayName, id, rpDisplayName from type &#39;Account&#39;.</code></pre>\n<h2 id=\"official-documentation\">Official documentation</h2>\n<p>It&#39;s lacking behind. TS v3.3 is the latest now. <code>BigInt</code> has been added in v3.2 but official documentation hasn&#39;t been updated.</p>\n<h2 id=\"syntax\">Syntax</h2>\n<p>JS started to feel heavy when they added object destructuring. Then defaults and renaming came. Only type annotations were missing. Oh, it could be nested. I know it can be easily avoided by code style rules but still sometimes I find myself hitting the timeout in trying to parse the function declaration.</p>\n<hr>\n<p>Alright. The path for more positive things looks much clear now. If you have any comments, please reach out to me, I&#39;d love to discuss that in more details. And stay tuned, originally planned articles will follow.</p>\n<h2 id=\"update\">Update</h2>\n<p>This article started a series on TypeScript. You can read them in any order as they aren&#39;t really connected apart from covering the same topic:</p>\n<ul>\n<li><a href=\"https://mikesub.net/blog/types_runtime_checks.html\">Types and runtime checks</a></li>\n<li><a href=\"https://mikesub.net/blog/types_string_semantics.html\">Types. String semantics</a></li>\n</ul>\n",
   "date_published": "2019-02-07T23:00:00+01:00"
  },
  {
   "id": "https://mikesub.net/blog/microblog.html",
   "url": "https://mikesub.net/blog/microblog.html",
   "content_html": "<p>a post testing micro.blog integration.</p>\n",
   "date_published": "2018-09-25T22:30:00+02:00"
  },
  {
   "title": "NL#2",
   "id": "https://mikesub.net/blog/nl_drafts.html",
   "url": "https://mikesub.net/blog/nl_drafts.html",
   "content_html": "<p>Прошло полгода после анонса, а я так и не закончил свою первую заметку про Нидерланды. Чтобы как-то сдвинуть дело, начну выкладывать черновики записей: <a href=\"https://t.me/transmith\">https://t.me/transmith</a> Возможно, позже получится из них собрать что-то полноценное.</p>\n",
   "date_published": "2018-02-12T21:59:00+01:00"
  },
  {
   "title": "NL",
   "id": "https://mikesub.net/blog/nl.html",
   "url": "https://mikesub.net/blog/nl.html",
   "content_html": "<p>Стояло жаркое лето середины 90-х и я пытался изо всех сил угнаться за своим братом на велосипеде. Он ехал на «Украине», я на чём-то поменьше. Первые километра четыре шли по довольно спокойной асфальтированной дороге, одной из тех, которая ведет от шоссе к десяткам деревень и дачных посёлков. Оставшийся же путь надо было проделать по пыльной обочине горьковского шоссе. Там, где-то не доезжая Покрова, было что-то придорожное, где можно было купить аэрозоль против насекомых. Он понадобился, чтобы вывести совсем уж наглых размеров осиное гнездо на чердаке дома, где мы летом спали.</p>\n<p>Жару усугубляли резкие порывы горячего пыльного воздуха от фур, проносившихся мимо. Когда мы доехали до заветного грубо сколоченного придорожного ларька, помимо аэрозоли брат купил банку Amsterdam Navigator. Он был крепкий, теплый и пена из банки моментально сделала наши руки отвратительно липкими.</p>\n<hr>\n<p>Спустя лет пятнадцать, пасмурным осенним днём мы купили бутылку виски, поехали в нижнее течении Москвы-реки, и надев резиновые сапоги, зашли постоять в воду и выпить. Так мы тогда оказались в Лыткарино, на другом берегу реки от деревни Андреевское. Там были очистные сооружения, 24 маленькие градирни, бывший колхоз им. Ленина, испытательный комплекс Центрального института авиационного моторостроения и жилой комплекс «Адмиралтейский». Через несколько месяцев со мной на фликре связался дизайнер из Голландии и предложил купить права на фотографию, сделанную в тот день. Я согласился и спустя некоторое время в Голландии вышел какой-то проходной роман с моей будущей женой и её подругой на обложке. Мне прислали несколько экземпляров и тогда я решил при случае выучить голландский, чтобы всё-таки прочитать эту книгу.</p>\n<hr>\n<p>Еще переместимся на шесть лет вперед, и вот я выхожу из аэропорта Скипхол, еду заселяться в номер отеля, на следующий день приезжаю в офис какого-то издательского дома, прохожу интервью и в результате, получив офер, решаю остаться в Москве. В тот же день происходит авиакатастрофа рейса MH17 Амстердам—Куала-Лумпур в Донецкой области.</p>\n<hr>\n<p>Еще вперед на три года и вот я уже не обращаю внимания на дождь, если это не ливень, у меня уже украли один велосипед и, кажется, я готов рассказать про вотсап-дружины, про фризский язык, про особенности банковской системы, про то, что почти невозможно возить велосипеды в электричках и про то, что имеет смысл дарить уезжающим сюда.</p>\n",
   "date_published": "2017-08-31T10:00:00+02:00"
  },
  {
   "title": "10 years a web developer",
   "id": "https://mikesub.net/blog/10_years_a_developer.html",
   "url": "https://mikesub.net/blog/10_years_a_developer.html",
   "content_html": "<p>On December 2006 I joined a digital agency as a humble HTML coder. There was neither Chrome nor iPhone yet, IE market share was around 85%, table-based layouts ruled the internet and we all were debugging using <em>window.alert</em> calls.</p>\n<p>Fast-forward 10 years. Chrome&#39;s released v.54, iPhone is in its 10th generation, IE has less than 15%. Web standards and its support, development tools and other technologies involved improved drastically but same happened to the complexity of products being developed nowadays. And it seems that these things are evolving nearly at the same rate. There is more or less same gap there, dev.tools can&#39;t keep up with things for which we use them. Be frank, it&#39;s still a pain in the neck to develop front-end stuff. We&#39;ve conquered basic blocks, but interfaces are getting more sophisticated, the web is being accessed from more devices, etc.</p>\n<p>And I can&#39;t name anything that would change this.</p>\n",
   "date_published": "2016-11-24T14:20:00+01:00"
  },
  {
   "title": "Пусть бегут",
   "id": "https://mikesub.net/blog/let_them_run.html",
   "url": "https://mikesub.net/blog/let_them_run.html",
   "content_html": "<p>Ну а если серьёзно про 2015 год, то чаще остального мы вспоминаем момент с одной из пробежек. Мы подбегали к небольшой горке, по которой поднимался мальчик лет 5-6 на\nвелосипеде. Ему было тяжело забираться, но он не сдавался, медленно и методично крутил педали. Тут мы с разбега забегаем на эту горку и начинаем его догонять. В\nкакой-то момент равняемся с ним, а потом начинаем медленно обгонять. Мальчик сначала прибавляет и пытается не дать себя обогнать, всё-таки он же на велосипеде, но\nвскоре сдаётся и произносит как бы про себя, но вслух, в сторону: «Пусть бегут».</p>\n",
   "date_published": "2015-12-31T09:06:00+01:00"
  },
  {
   "title": "about:blank",
   "id": "https://mikesub.net/blog/about_blank.html",
   "url": "https://mikesub.net/blog/about_blank.html",
   "content_html": "<p>Я очень скучаю по чистой вкладке, пустой белой странице. Когда-то все браузеры при открытии вкладки показывали\nчистую страницу и пользователь мог либо ввести адрес в адресную строку, либо выбрать страницу из закладок. Потом интерфейс\nстал обрастать и появился вывод истории недавних посещений, списки популярных сайтов. Гугл начал показывать по сути свою\nстартовую страницу, одно время показывал свои приложения и т.п.</p>\n<p>Одно время это было опционально, но сейчас уже в хроме настроить показ пустой страницы нельзя. Вслед за ним опера и\nяндекс также не дают такую возможность. В сафари и фаерфоксе такая опция осталась, но неизвестно надолго ли.</p>\n<p>Я держу свой рабочий стол (тот, который на компьютере) абсолютно пустым, без обоев, с одноцветной заливкой. Переключаясь\nна него, я попадаю на чистый лист и из спотлайта начинаю новую задачу. Также и в браузере. Если мне операционная система\nвместо пустого десктопа будет выводить какие-нибудь списки недавно открытых файлов, популярных приложений — не знаю\nсмогу ли я к этому привыкнуть, либо придется искать обходные пути отключения этой функциональности.</p>\n<p>На написание этой заметки меня натолкнул\n<a href=\"http://blog.flickr.net/en/2015/03/18/flickr-tab-in-google-chrome/\">flickr tab</a>, расширение для хрома, которое в каждой новой вкладке показывает\nслучайную популярную фотографию с одноименного сервиса. Я его установил в попытке избежать мусорной стартовой страницы.\nНо в результате поймал себя за тем, что открывая новый вкладку, я автоматически открываю еще одну, так как срабатывает\nрефлекс того, что я очутился не на новой вкладке, а просто переключился на какую-то старую, в которой что-то уже открыто.</p>\n<p>Ну и немного про обои рабочего стола: из-за моих настроек я долго не замечал в yosemite полупрозрачного фона боковых\nпанелей, меню и прочих элементов. Из-за однотонного темносерого фона я просто считал, что всё в новой ОС тускло и\nстранно. Только случайно, поставив каких-то ярких слонов на рабочий стол, я заметил эту полупрозрачность. Слонов я убрал\nи поставил крыжик в system preferences &gt; accessibility &gt; reduce transparency, чего всем и советую.</p>\n",
   "date_published": "2015-03-26T15:45:00+01:00"
  },
  {
   "title": "Гугл мой спотлайт",
   "id": "https://mikesub.net/blog/google_my_spotlight.html",
   "url": "https://mikesub.net/blog/google_my_spotlight.html",
   "content_html": "<p>В продолжение «<a href=\"http://ilyabirman.ru/meanwhile/all/web-or-native-future/\">Будущего нативных и веб-приложений</a>» Ильи Бирмана.</p>\n<p>Да, веб-приложения сейчас часто неудобнее нативных аналогов. На мобильных платформах это еще больше ощущается, чем\nна десктопах. Одновременно с этим то, что открывается по ссылке в браузере, далеко и давно ушло от понятия\nвеб-страницы. Даже простейший блог со статьями, который, казалось бы, наиболее близок к тому, зачем придумали интернет —\nуже не список статей с перекрестными ссылками. Поиск, комментарии, админка — всё это ближе к сервису/приложению нежели\nк странице.</p>\n<p>Но разработчики веб-сервисов с одной стороны и разработчики браузеров с другой до сих расценивают интернет как список\nвеб-страниц.</p>\n<p>Представьте, если бы при запуске нативного приложения, вы бы попадали на лэндинг/промо- страницу с описанием сервиса, а\nне туда, где вы остановили работу в этом приложении. В вебе такое еще можно встретить.</p>\n<p>Представьте, что ваш док приложений — список безликих иконок «программа». В вебе сейчас это так. В Apple пошли\nдальше и убрали даже фавиконки у закладок в Safari.</p>\n<p>Представьте, что каждый раз при запуске приложения вам необходимо было бы вводить логин/пароль. Такое в вебе еще встречается.\nВ идеале вся авторизация в вебе должна остаться в случаях, требующих дополнительной защиты. Также как в нативных\nприложениях 1Password требует дополнительную авторизацию, а почтовый клиент не требует, также и в браузере интернет-банк\nпусть требует.</p>\n<p>А теперь представьте, что вы могли бы себе в док (или из спотлайта) попасть сразу в нужную папку вашего почтового клиента\nили в нужный список reminders в обход разводящего экрана.</p>\n<p>Но мы неизбежно к этому идём и те, кто избавляются от концепции URLов в своих веб-приложениях (привет, интернет-банки),\nкто по умолчанию выставляет режим «не запоминать пароль» — все они идут не в ту сторону.</p>\n",
   "date_published": "2015-03-26T00:15:00+01:00"
  },
  {
   "title": "Верстальщики: от программистов к дизайнерам",
   "id": "https://mikesub.net/blog/html_designers.html",
   "url": "https://mikesub.net/blog/html_designers.html",
   "content_html": "<p>Изначально HTML создавался как markdown или разметка wiki. Как сейчас нет markdown-верстальщика, word-писателя, так и\nизначально не было HTML—верстальщика. Это было еще один формат разметки текста.</p>\n<p>Почти сразу HTML стали использовать не для создания документов с гиперссылками, а чего-угодно с гиперссылками.\nТак появились веб-сайты: интерактивные документы, с одной стороны пытающие предоставить интерфейс по аналогии с GUI\nвсего остального компьютера, с другой стороны предоставить вёрстку в полиграфическом смысле. Технология этого\nне позволяла. С интерактивностью еще куда ни шло, появились веб-формы, а вот с вёрсткой (раскладка, сетки,\nблоки) — с этим были большие проблемы. Но никто ничего знать не хотел и поэтому в ход шли таблицы, распорки в виде\nпрозрачных изображений и т.д. Собственно, из-за этого вся эта сложность, инструментария нет, есть несколько программ\n(браузеров), которые воспринимают инструкции по—разному, а плохие дизайнеры показывают нарисованные макеты в растровом\nграфическом формате и настаивают на своём.</p>\n<p>Поэтому выделились люди, которые могли как-то заставить браузер отрисовывать то, что нарисовал дизайнер. Cо временем,\nтехнологии и инструменты прогрессировали и эволюционировали, и стало возможным верстать предназначенными для этого\nсредствами, а не костылями. Так ушла вёрстка таблицами, но до сих пор нет инструмента, который бы позволил полностью\nправильно сделать то, что вы рисуете. Но, конечно, ситуация гораздо лучше, чем несколько лет назад. Сейчас, если брать\nсовременный браузер, то, в целом, в HTML есть все нужные средства, и он опять превращается в более-менее простой\nинструмент вёрстки. В рамках прототипов/макетов на нем можно писать человеку не сильно вовлеченному во все\nэти технологии.</p>\n<p>Также сейчас с появлением AJAX-подгрузки частей страницы, возможностей анимации, адаптивного подстраивания под разные\nразмеры окна, всё это сложнее и сложнее умещать в плоский PSD-макет. Теперь вместе с макетом идёт документация или\nраскадровка разных состояний. Но когда перед разработчиком плоский макет, то не видно всей логики, которую\nзакладывал проектировщик/дизайнер: это просто два разных цвета, или этот цвет — функция от того цвета (затемнение на\n20%), это 10px или это расстояние зависит от состояния вот того блока, или это какой-нибудь «стандартный отступ при\nтаких-то условиях» и тому подобное.</p>\n<p>То есть информация заложенная дизайнером так или иначе теряется, и приходится сажать рядом дизайнера, чтобы он объяснял\nпо картинке, почему где как, или писать документацию, или дробить разработку на много итераций, постоянно показывая\nрезультат и внося в него изменения.</p>\n<p>И тут начинается самое интересное. Сейчас технология развивается, уже можно делать раскладку без использования неявных\nпобочных эффектов каких-либо свойств, уже можно сохранять зависимости размеров, цветов и прочего используя удобные\nпре- и пост- процессоры, которые довольно по-человечески работают.</p>\n<p>И, возвращаясь к интерактивности, популярного сейчас параллакс-эффекта и т.д., win-win ситуация для проектировщика\nинтерфейса — когда он как минимум на одном языке разговаривает с разработчиком, и как максимум, а технологии уже\nэто позволяют, набрасывает какие-то прототипы, которые верстальщик уже потом доведёт до своих стандартов качества,\nне забудет про всякие сложные моменты и сделает, чтобы это везде работало, как задумано.</p>\n<p>ну и конечно все эти анимации и резиновость - это тоже на статических макетах не опишешь, приходится отдельно\nдокументацию какую-то прикладывать, которая слепая (всяко лучше самому это реализовать и увидеть как это\nна самом деле в браузере будет работать).</p>\n<p>Поэтому веб-вёрстка, изначально зародившаяся как инструмент программиста, после этого выделившись в отдельную\nспециализацию, сейчас плавно и верно перетекает в сторону проектировщиков интерфейсов и это отлично. А верстальщики\nвместе с этим плавно перетекают либо в дизайнеров, либо в программистов и это прекрасно.</p>\n",
   "date_published": "2015-03-22T00:15:00+01:00"
  }
 ]
}